Repository: airtaxi/CodexAccountSwitch.WinUI
Catalog: CliAccountSwitcher.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, ko_kr, zh_hans, zh_hant

# OpenCodeGoApiKeyAddAccountPage_ApiKeyPasswordBox.PlaceholderText
source: Paste your OpenCode Go API key
ja_jp: OpenCode Go API キーを貼り付け
ko_kr: OpenCode Go API 키 붙여넣기
zh_hans: 粘贴您的 OpenCode Go API 密钥
zh_hant: 貼上您的 OpenCode Go API 金鑰

# OpenCodeGoApiKeyAddAccountPage_DescriptionTextBlock.Text
source: Add an OpenCode Go account by pasting an API key. An optional label helps distinguish multiple keys.
ja_jp: API キーを貼り付けて OpenCode Go アカウントを追加します。複数のキーを区別するには任意のラベルを入力してください。
ko_kr: API 키를 붙여넣어 OpenCode Go 계정을 추가합니다. 여러 키를 구분하려면 선택 라벨을 입력하세요.
zh_hans: 粘贴 API 密钥以添加 OpenCode Go 账户。输入可选标签以区分多个密钥。
zh_hant: 貼上 API 金鑰以新增 OpenCode Go 帳戶。輸入選用標籤以區分多個金鑰。

# OpenCodeGoApiKeyAddAccountPage_ErrorInfoBar.Message
source: The API key could not be verified. Check the key and try again.
ja_jp: API キーを検証できませんでした。キーを確認して再試行してください。
ko_kr: API 키를 확인할 수 없습니다. 키를 확인하고 다시 시도하세요.
zh_hans: 无法验证 API 密钥。请检查密钥后重试。
zh_hant: 無法驗證 API 金鑰。請檢查金鑰後再試一次。

# OpenCodeGoApiKeyAddAccountPage_ErrorInfoBar.Title
source: Invalid API key
ja_jp: 無効な API キー
ko_kr: 유효하지 않은 API 키
zh_hans: API 密钥无效
zh_hant: API 金鑰無效

# OpenCodeGoApiKeyAddAccountPage_ErrorInfoBar_SubscriptionRequiredMessage
source: The OpenCode Go subscription is required to use this API key. Check your subscription and try again.
ja_jp: この API キーを使用するには OpenCode Go サブスクリプションが必要です。サブスクリプションの状態を確認して再試行してください。
ko_kr: 이 API 키를 사용하려면 OpenCode Go 구독이 필요합니다. 구독 상태를 확인하고 다시 시도하세요.
zh_hans: 使用此 API 密钥需要 OpenCode Go 订阅。请检查订阅状态后重试。
zh_hant: 使用此 API 金鑰需要 OpenCode Go 訂閱。請檢查訂閱狀態後重試。

# OpenCodeGoApiKeyAddAccountPage_ErrorInfoBar_SubscriptionRequiredTitle
source: Subscription required
ja_jp: サブスクリプションが必要です
ko_kr: 구독 필요
zh_hans: 需要订阅
zh_hant: 需要訂閱

# OpenCodeGoApiKeyAddAccountPage_TitleTextBlock.Text
source: Enter API key
ja_jp: API キーを入力
ko_kr: API 키 입력
zh_hans: 输入 API 密钥
zh_hant: 輸入 API 金鑰

# OpenCodeGoCurrentAccountAddAccountPage_DescriptionTextBlock.Text
source: Imports the API key stored in the OpenCode Go auth file.
ja_jp: OpenCode Go 認証ファイルに保存されている API キーをインポートします。
ko_kr: OpenCode Go 인증 파일에 저장된 API 키를 가져옵니다.
zh_hans: 导入存储在 OpenCode Go 认证文件中的 API 密钥。
zh_hant: 匯入儲存在 OpenCode Go 認證檔案中的 API 金鑰。

# OpenCodeGoCurrentAccountAddAccountPage_ErrorInfoBar.Message
source: The OpenCode Go auth file could not be read or the API key is invalid.
ja_jp: OpenCode Go 認証ファイルを読み取れないか、API キーが無効です。
ko_kr: OpenCode Go 인증 파일을 읽을 수 없거나 API 키가 유효하지 않습니다.
zh_hans: 无法读取 OpenCode Go 认证文件或 API 密钥无效。
zh_hant: 無法讀取 OpenCode Go 認證檔案或 API 金鑰無效。

# OpenCodeGoCurrentAccountAddAccountPage_ErrorInfoBar.Title
source: Import failed
ja_jp: インポートに失敗しました
ko_kr: 가져오기 실패
zh_hans: 导入失败
zh_hant: 匯入失敗

# OpenCodeGoCurrentAccountAddAccountPage_FilePathHeaderTextBlock.Text
source: Auth file
ja_jp: 認証ファイル
ko_kr: 인증 파일
zh_hans: 认证文件
zh_hant: 認證檔案

# OpenCodeGoCurrentAccountAddAccountPage_ImportButtonTextBlock.Text
source: Import
ja_jp: インポート
ko_kr: 가져오기
zh_hans: 导入
zh_hant: 匯入

# OpenCodeGoCurrentAccountAddAccountPage_TitleTextBlock.Text
source: Import from OpenCode Go
ja_jp: OpenCode Go からインポート
ko_kr: OpenCode Go에서 가져오기
zh_hans: 从 OpenCode Go 导入
zh_hant: 從 OpenCode Go 匯入

# PrimaryUsageAverageRateWarningTextBlock.Text
source: Over average pace
ja_jp: 平均超過ペース
ko_kr: 평균 속도 초과
zh_hans: 超过平均速度
zh_hant: 超過平均速度

# ProviderAccountViewModel_ActiveStatus
source: Active
ja_jp: アクティブ
ko_kr: 활성
zh_hans: 活跃
zh_hant: 使用中

# ProviderAccountViewModel_LastUsageRefreshFormat
source: Last refreshed: {0}
ja_jp: 最終更新: {0}
ko_kr: 마지막 갱신: {0}
zh_hans: 上次刷新：{0}
zh_hant: 上次重新整理：{0}

# ProviderAccountViewModel_MonthlyUsageWindowLabel
source: Monthly limit
ja_jp: 月次制限
ko_kr: 월간 한도
zh_hans: 每月限额
zh_hant: 每月限額

# ProviderAccountViewModel_NoAccessToken
source: None
ja_jp: なし
ko_kr: 없음
zh_hans: 无
zh_hant: 無

# ProviderAccountViewModel_NotRefreshed
source: Not refreshed yet
ja_jp: まだ更新されていません
ko_kr: 아직 갱신되지 않음
zh_hans: 尚未刷新
zh_hant: 尚未重新整理

# ProviderAccountViewModel_PrimaryUsageWindowLabel
source: 5-hour limit
ja_jp: 5時間制限
ko_kr: 5시간 한도
zh_hans: 5 小时限制
zh_hant: 5 小時限制

# ProviderAccountViewModel_ResetAfterFormat
source: resets in {0:hh\:mm\:ss}
ja_jp: {0:hh\:mm\:ss} 後にリセット
ko_kr: {0:hh\:mm\:ss} 후 재설정
zh_hans: 将在 {0:hh\:mm\:ss} 后重置
zh_hant: 將於 {0:hh\:mm\:ss} 後重設

# ProviderAccountViewModel_ResetAfterWithMultipleDaysFormat
source: resets in {0} days {1:hh\:mm\:ss}
ja_jp: {0}日 {1:hh\:mm\:ss} 後にリセット
ko_kr: {0}일 {1:hh\:mm\:ss} 후 재설정
zh_hans: 将在 {0} 天 {1:hh\:mm\:ss} 后重置
zh_hant: 將於 {0} 天 {1:hh\:mm\:ss} 後重設

# ProviderAccountViewModel_ResetAfterWithSingleDayFormat
source: resets in 1 day {0:hh\:mm\:ss}
ja_jp: 1日 {0:hh\:mm\:ss} 後にリセット
ko_kr: 1일 {0:hh\:mm\:ss} 후 재설정
zh_hans: 将在 1 天 {0:hh\:mm\:ss} 后重置
zh_hant: 將於 1 天 {0:hh\:mm\:ss} 後重設

# ProviderAccountViewModel_SecondaryUsageWindowLabel
source: 7-day limit
ja_jp: 7日間制限
ko_kr: 7일 한도
zh_hans: 7 天限制
zh_hant: 7 天限制

# ProviderAccountViewModel_TokenExpiredStatus
source: Token Expired
ja_jp: トークン期限切れ
ko_kr: 토큰 만료
zh_hans: 令牌已过期
zh_hant: 權杖已過期

# ProviderAccountViewModel_UnknownPlan
source: Unknown
ja_jp: 不明
ko_kr: 알 수 없음
zh_hans: 未知
zh_hant: 未知

# ProviderAccountViewModel_UnknownResetTime
source: Reset time unavailable
ja_jp: リセット時刻を取得できません
ko_kr: 재설정 시간 알 수 없음
zh_hans: 无法获取重置时间
zh_hant: 無法取得重設時間

# ProviderAccountViewModel_UnknownUsage
source: Usage unavailable
ja_jp: 使用量を取得できません
ko_kr: 사용량 알 수 없음
zh_hans: 无法获取用量
zh_hant: 無法取得用量

# ProviderAccountViewModel_UsageRemainingFormat
source: {0}% remaining · {1}
ja_jp: 残り {0}% · {1}
ko_kr: {0}% 남음 · {1}
zh_hans: 剩余 {0}% · {1}
zh_hant: 剩餘 {0}% · {1}

# ProviderAccountViewModel_UsageRemainingOnlyFormat
source: {0}% remaining
ja_jp: 残り {0}%
ko_kr: {0}% 남음
zh_hans: 剩余 {0}%
zh_hant: 剩餘 {0}%

# ProviderAccountViewModel_WaitingStatus
source: Waiting
ja_jp: 待機中
ko_kr: 대기
zh_hans: 等待中
zh_hant: 等待中

# Provider_OllamaComboBoxItem.Content
source: Ollama (Read-only)
ja_jp: Ollama (読み取り専用)
ko_kr: Ollama (읽기 전용)
zh_hans: Ollama (只读)
zh_hant: Ollama (唯讀)

# Provider_ZaiComboBoxItem.Content
source: Z.ai (Read-only)
ja_jp: Z.ai (読み取り専用)
ko_kr: Z.ai (읽기 전용)
zh_hans: Z.ai（只读）
zh_hant: Z.ai（唯讀）

# SecondaryUsageAverageRateWarningTextBlock.Text
source: Over average pace
ja_jp: 平均超過ペース
ko_kr: 평균 속도 초과
zh_hans: 超过平均速度
zh_hant: 超過平均速度

# SettingsPage_AccountSettingsGroup.Description
source: Configure account health checks, automatic refresh, low-quota thresholds, and saved notification flags.
ja_jp: アカウントの正常性チェック、自動更新、低クォータしきい値、保存済み通知フラグを設定します。
ko_kr: 계정 상태 확인, 자동 새로고침, 저할당량 기준과 알림 저장값을 설정합니다.
zh_hans: 配置账号健康检查、自动刷新、低配额阈值和已保存的通知标志。
zh_hant: 設定帳號健康檢查、自動重新整理、低配額閾值與已儲存通知旗標。

# SettingsPage_AccountSettingsGroup.Header
source: Account settings
ja_jp: アカウント設定
ko_kr: 계정 설정
zh_hans: 账号设置
zh_hant: 帳號設定

# SettingsPage_ActiveAccountNextUsageRefreshSettingsCard.Description
source: Time remaining before active account usage refreshes again.
ja_jp: アクティブアカウントの使用量が次に更新されるまでの残り時間です。
ko_kr: 활성 계정 사용량이 다시 새로고침되기까지 남은 시간입니다.
zh_hans: 活跃账号用量再次刷新前的剩余时间。
zh_hant: 使用中帳號用量再次重新整理前的剩餘時間。

# SettingsPage_ActiveAccountNextUsageRefreshSettingsCard.Header
source: Next refresh
ja_jp: 次回更新
ko_kr: 다음 새로고침
zh_hans: 下次刷新
zh_hant: 下次重新整理

# SettingsPage_ActiveAccountUsageRefreshIntervalSettingsCard.Description
source: Set how often active account usage refreshes, in seconds.
ja_jp: アクティブアカウントの使用量を何秒ごとに更新するか設定します。
ko_kr: 활성 계정 사용량을 몇 초마다 새로고침할지 설정합니다.
zh_hans: 设置活跃账号用量每隔多少秒刷新一次。
zh_hant: 設定使用中帳號用量每隔多少秒重新整理一次。

# SettingsPage_ActiveAccountUsageRefreshIntervalSettingsCard.Header
source: Refresh interval
ja_jp: 更新間隔
ko_kr: 새로고침 간격
zh_hans: 刷新间隔
zh_hant: 重新整理間隔

# SettingsPage_ActiveAccountUsageRefreshSettingsCard.Description
source: Refresh usage for the active account at the selected second interval.
ja_jp: 選択した秒間隔でアクティブアカウントの使用量を更新します。
ko_kr: 활성 계정의 사용량을 지정한 초 단위 간격으로 새로고침합니다.
zh_hans: 按所选秒间隔刷新活跃账号的用量。
zh_hant: 按所選秒間隔重新整理使用中帳號的用量。

# SettingsPage_ActiveAccountUsageRefreshSettingsCard.Header
source: Active account automatic refresh
ja_jp: アクティブアカウントの自動更新
ko_kr: 활성 계정 자동 새로고침
zh_hans: 活跃账号自动刷新
zh_hant: 使用中帳號自動重新整理

# SettingsPage_ApplicationSettingsFileTypeChoice
source: CLI Account Switcher settings file
ja_jp: CLI Account Switcher 設定ファイル
ko_kr: CLI Account Switcher 설정 파일
zh_hans: CLI Account Switcher 设置文件
zh_hant: CLI Account Switcher 設定檔案

# SettingsPage_ApplicationSettingsTransferSettingsExpander.Description
source: Save or load app settings as a .casc file without including the account list.
ja_jp: アカウント一覧を含めずに、アプリ設定を .casc ファイルとして保存または読み込みます。
ko_kr: 계정 목록을 제외한 앱 설정을 .casc 파일로 저장하거나 불러옵니다.
zh_hans: 将不包含账号列表的应用设置保存为 .casc 文件，或从该文件加载。
zh_hant: 將不包含帳號清單的應用程式設定儲存為 .casc 檔案，或從該檔案載入。

# SettingsPage_ApplicationSettingsTransferSettingsExpander.Header
source: Import/export settings
ja_jp: 設定のインポート/エクスポート
ko_kr: 설정 불러오기/내보내기
zh_hans: 导入/导出设置
zh_hant: 匯入/匯出設定

# SettingsPage_ApplicationVersionFormat
source: Current version: {0}
ja_jp: 現在のバージョン: {0}
ko_kr: 현재 버전: {0}
zh_hans: 当前版本：{0}
zh_hant: 目前版本：{0}

# SettingsPage_AutomaticRefreshDisabledText
source: Automatic refresh is off
ja_jp: 自動更新はオフです
ko_kr: 자동 새로고침 꺼짐
zh_hans: 自动刷新已关闭
zh_hant: 自動重新整理已關閉

# SettingsPage_AutomaticUpdateCheckSettingsCard.Description
source: Check for Store updates every 8 hours and show a notification when one is found.
ja_jp: 8時間ごとに Store の更新を確認し、見つかった場合は通知を表示します。
ko_kr: 8시간마다 Store 업데이트를 확인하고 발견 시 알림을 표시합니다.
zh_hans: 每 8 小时检查 Store 更新，发现更新时显示通知。
zh_hant: 每 8 小時檢查 Store 更新，找到更新時顯示通知。

# SettingsPage_AutomaticUpdateCheckSettingsCard.Header
source: Automatic update checks
ja_jp: 自動更新チェック
ko_kr: 자동 업데이트 확인
zh_hans: 自动检查更新
zh_hant: 自動檢查更新

# SettingsPage_AutomaticUpdateSettingsCard.Description
source: Check for Store updates every 8 hours and show a notification when one is found.
ja_jp: 8時間ごとに Store の更新を確認し、見つかった場合は通知を表示します。
ko_kr: 8시간마다 Store 업데이트를 확인하고 발견 시 알림을 표시합니다.
zh_hans: 每 8 小时检查 Store 更新，发现更新时显示通知。
zh_hant: 每 8 小時檢查 Store 更新，發現更新時顯示通知。

# SettingsPage_AutomaticUpdateSettingsCard.Header
source: Automatic update checks
ja_jp: 自動更新チェック
ko_kr: 자동 업데이트 확인
zh_hans: 自动检查更新
zh_hant: 自動檢查更新

# SettingsPage_CheckForUpdatesButtonTextBlock.Text
source: Check
ja_jp: 確認
ko_kr: 확인
zh_hans: 检查
zh_hant: 檢查

# SettingsPage_CheckForUpdatesLoadingMessage
source: Checking Microsoft Store updates.
ja_jp: Microsoft Store の更新を確認しています。
ko_kr: Microsoft Store 업데이트를 확인하는 중입니다.
zh_hans: 正在检查 Microsoft Store 更新。
zh_hant: 正在檢查 Microsoft Store 更新。

# SettingsPage_DarkThemeComboBoxItem.Content
source: Dark
ja_jp: ダーク
ko_kr: 다크
zh_hans: 深色
zh_hant: 深色

# SettingsPage_DescriptionTextBlock.Text
source: Adjust app display, updates, startup behavior, and automatic account management.
ja_jp: アプリの表示、更新、スタートアップ動作、自動アカウント管理を調整します。
ko_kr: 앱 표시, 업데이트, 시작 동작, 계정 자동 관리 방식을 조정합니다.
zh_hans: 调整应用显示、更新、启动行为和自动账号管理。
zh_hant: 調整應用程式顯示、更新、啟動行為和自動帳號管理。

# SettingsPage_EnglishLanguageComboBoxItem.Content
source: English
ja_jp: 英語
ko_kr: 영어
zh_hans: 英语
zh_hant: 英文

# SettingsPage_ExpiredAccountAutomaticDeletionSettingsCard.Description
source: Remove accounts from the list automatically when authentication is rejected during refresh.
ja_jp: 更新中に認証が拒否されたアカウントを一覧から自動的に削除します。
ko_kr: 새로고침 중 인증이 거부된 계정을 자동으로 목록에서 제거합니다.
zh_hans: 刷新期间身份验证被拒绝时，自动从列表中删除账号。
zh_hant: 重新整理期間驗證被拒絕時，自動從清單中刪除帳號。

# SettingsPage_ExpiredAccountAutomaticDeletionSettingsCard.Header
source: Automatically delete invalid accounts
ja_jp: 無効なアカウントを自動削除
ko_kr: 비정상 계정 자동 삭제
zh_hans: 自动删除无效账号
zh_hant: 自動刪除無效帳號

# SettingsPage_ExpiredAccountNotificationSettingsCard.Description
source: Show a Windows notification when an expired or unusable account is detected.
ja_jp: 期限切れまたは使用できないアカウントが検出されたときに Windows 通知を表示します。
ko_kr: 만료되었거나 사용할 수 없는 계정을 발견하면 Windows 알림을 표시합니다.
zh_hans: 检测到过期或无法使用的账号时显示 Windows 通知。
zh_hant: 偵測到過期或無法使用的帳號時顯示 Windows 通知。

# SettingsPage_ExpiredAccountNotificationSettingsCard.Header
source: Notify when invalid accounts are found
ja_jp: 無効なアカウント検出時に通知
ko_kr: 비정상 계정 발견 시 알림
zh_hans: 发现无效账号时通知
zh_hant: 發現無效帳號時通知

# SettingsPage_ExportApplicationSettingsButtonTextBlock.Text
source: Export
ja_jp: エクスポート
ko_kr: 내보내기
zh_hans: 导出
zh_hant: 匯出

# SettingsPage_ExportApplicationSettingsDialogMessage
source: The app settings have been exported.
ja_jp: アプリ設定をエクスポートしました。
ko_kr: 앱 설정을 내보냈습니다.
zh_hans: 应用设置已导出。
zh_hant: 應用程式設定已匯出。

# SettingsPage_ExportApplicationSettingsDialogTitle
source: Export settings
ja_jp: 設定をエクスポート
ko_kr: 설정 내보내기
zh_hans: 导出设置
zh_hant: 匯出設定

# SettingsPage_ExportApplicationSettingsFailedDialogMessage
source: The app settings could not be exported. Please check file access permissions.
ja_jp: アプリ設定をエクスポートできませんでした。ファイルへのアクセス権限を確認してください。
ko_kr: 앱 설정을 내보내지 못했습니다. 파일 접근 권한을 확인해 주세요.
zh_hans: 无法导出应用设置。请检查文件访问权限。
zh_hant: 無法匯出應用程式設定。請檢查檔案存取權限。

# SettingsPage_ExportApplicationSettingsFailedDialogTitle
source: Settings export failed
ja_jp: 設定のエクスポートに失敗しました
ko_kr: 설정 내보내기 실패
zh_hans: 设置导出失败
zh_hant: 設定匯出失敗

# SettingsPage_ExportApplicationSettingsSettingsCard.Description
source: Save the current app settings to a .casc file.
ja_jp: 現在のアプリ設定を .casc ファイルに保存します。
ko_kr: 현재 앱 설정을 .casc 파일로 저장합니다.
zh_hans: 将当前应用设置保存到 .casc 文件。
zh_hant: 將目前應用程式設定儲存到 .casc 檔案。

# SettingsPage_ExportApplicationSettingsSettingsCard.Header
source: Export settings
ja_jp: 設定をエクスポート
ko_kr: 설정 내보내기
zh_hans: 导出设置
zh_hant: 匯出設定

# SettingsPage_ExportIntegratedLogButtonTextBlock.Text
source: Save
ja_jp: 保存
ko_kr: 저장
zh_hans: 保存
zh_hant: 儲存

# SettingsPage_ExportIntegratedLogDialogMessage
source: The log was saved.
ja_jp: ログを保存しました。
ko_kr: 로그를 저장했습니다.
zh_hans: 日志已保存。
zh_hant: 日誌已儲存。

# SettingsPage_ExportIntegratedLogDialogTitle
source: Log export completed
ja_jp: ログ保存が完了しました
ko_kr: 로그 저장 완료
zh_hans: 日志导出完成
zh_hant: 日誌匯出完成

# SettingsPage_ExportIntegratedLogEmptyDialogMessage
source: There are no logs recorded in the current app session.
ja_jp: 現在のアプリ セッションには記録されたログがありません。
ko_kr: 현재 앱 세션에 기록된 로그가 없습니다.
zh_hans: 当前应用会话中没有记录的日志。
zh_hant: 目前應用程式工作階段中沒有記錄的日誌。

# SettingsPage_ExportIntegratedLogEmptyDialogTitle
source: No logs
ja_jp: ログはありません
ko_kr: 로그 없음
zh_hans: 没有日志
zh_hant: 沒有日誌

# SettingsPage_ExportIntegratedLogFailedDialogMessage
source: The log could not be saved. Check file access permissions and try again.
ja_jp: ログを保存できませんでした。ファイルのアクセス権限を確認してください。
ko_kr: 로그를 저장하지 못했습니다. 파일 접근 권한을 확인해 주세요.
zh_hans: 无法保存日志。请检查文件访问权限。
zh_hant: 無法儲存日誌。請檢查檔案存取權限。

# SettingsPage_ExportIntegratedLogFailedDialogTitle
source: Log export failed
ja_jp: ログのエクスポートに失敗しました
ko_kr: 로그 내보내기 실패
zh_hans: 日志导出失败
zh_hant: 日誌匯出失敗

# SettingsPage_GeneralSettingsGroup.Description
source: Configure language, theme, update checks, and system startup behavior.
ja_jp: 言語、テーマ、更新チェック、システム起動時の動作を設定します。
ko_kr: 언어, 테마, 업데이트 확인, 시스템 시작 동작을 설정합니다.
zh_hans: 配置语言、主题、更新检查和系统启动行为。
zh_hant: 配置語言、主題、更新檢查和系統啟動行為。

# SettingsPage_GeneralSettingsGroup.Header
source: General settings
ja_jp: 一般設定
ko_kr: 일반 설정
zh_hans: 常规设置
zh_hant: 一般設定

# SettingsPage_ImportApplicationSettingsButtonTextBlock.Text
source: Import
ja_jp: インポート
ko_kr: 불러오기
zh_hans: 导入
zh_hant: 匯入

# SettingsPage_ImportApplicationSettingsDialogMessage
source: The app settings have been imported and applied.
ja_jp: アプリ設定をインポートして適用しました。
ko_kr: 앱 설정을 불러와 적용했습니다.
zh_hans: 应用设置已导入并应用。
zh_hant: 應用程式設定已匯入並套用。

# SettingsPage_ImportApplicationSettingsDialogTitle
source: Import settings
ja_jp: 設定をインポート
ko_kr: 설정 불러오기
zh_hans: 导入设置
zh_hant: 匯入設定

# SettingsPage_ImportApplicationSettingsFailedDialogMessage
source: The app settings could not be imported from the selected .casc file. Please check the file format and access permissions.
ja_jp: 選択した .casc ファイルからアプリ設定をインポートできませんでした。ファイル形式とアクセス権限を確認してください。
ko_kr: 선택한 .casc 파일에서 앱 설정을 불러오지 못했습니다. 파일 형식과 접근 권한을 확인해 주세요.
zh_hans: 无法从所选 .casc 文件导入应用设置。请检查文件格式和访问权限。
zh_hant: 無法從所選 .casc 檔案匯入應用程式設定。請檢查檔案格式和存取權限。

# SettingsPage_ImportApplicationSettingsFailedDialogTitle
source: Settings import failed
ja_jp: 設定のインポートに失敗しました
ko_kr: 설정 불러오기 실패
zh_hans: 设置导入失败
zh_hant: 設定匯入失敗

# SettingsPage_ImportApplicationSettingsLanguageChangedDialogMessage
source: The app settings have been imported and applied. The settings page will reload because the language changed. Restart the app to apply it reliably to every screen.
ja_jp: アプリ設定をインポートして適用しました。言語が変更されたため、設定ページを再読み込みします。すべての画面に確実に反映するには、アプリを再起動することをおすすめします。
ko_kr: 앱 설정을 불러와 적용했습니다. 언어가 변경되어 설정 화면을 다시 불러옵니다. 모든 화면에 안정적으로 반영하려면 앱을 재시작하는 것을 권장합니다.
zh_hans: 应用设置已导入并应用。由于语言已更改，设置页面将重新加载。建议重启应用，以可靠应用到每个屏幕。
zh_hant: 應用程式設定已匯入並套用。由於語言已變更，設定頁面將重新載入。建議重新啟動應用程式，以可靠套用到所有畫面。

# SettingsPage_ImportApplicationSettingsLoadingMessage
source: Importing app settings.
ja_jp: アプリ設定をインポートしています。
ko_kr: 앱 설정을 불러오는 중입니다.
zh_hans: 正在导入应用设置。
zh_hant: 正在匯入應用程式設定。

# SettingsPage_ImportApplicationSettingsSettingsCard.Description
source: Load app settings from a .casc file and apply them to the current settings.
ja_jp: .casc ファイルからアプリ設定を読み込み、現在の設定に適用します。
ko_kr: .casc 파일에서 앱 설정을 불러와 현재 설정에 적용합니다.
zh_hans: 从 .casc 文件加载应用设置并应用到当前设置。
zh_hant: 從 .casc 檔案載入應用程式設定並套用到目前設定。

# SettingsPage_ImportApplicationSettingsSettingsCard.Header
source: Import settings
ja_jp: 設定をインポート
ko_kr: 설정 불러오기
zh_hans: 导入设置
zh_hant: 匯入設定

# SettingsPage_InactiveAccountNextUsageRefreshSettingsCard.Description
source: Time remaining before inactive account usage refreshes again.
ja_jp: 非アクティブアカウントの使用量が次に更新されるまでの残り時間です。
ko_kr: 비활성 계정 사용량이 다시 새로고침되기까지 남은 시간입니다.
zh_hans: 非活跃账号用量再次刷新前的剩余时间。
zh_hant: 非使用中帳號用量再次重新整理前的剩餘時間。

# SettingsPage_InactiveAccountNextUsageRefreshSettingsCard.Header
source: Next refresh
ja_jp: 次回更新
ko_kr: 다음 새로고침
zh_hans: 下次刷新
zh_hant: 下次重新整理

# SettingsPage_InactiveAccountUsageRefreshIntervalSettingsCard.Description
source: Set how often inactive account usage refreshes, in seconds.
ja_jp: 非アクティブアカウントの使用量を何秒ごとに更新するか設定します。
ko_kr: 비활성 계정 사용량을 몇 초마다 새로고침할지 설정합니다.
zh_hans: 设置非活跃账号用量每隔多少秒刷新一次。
zh_hant: 設定非使用中帳號用量每隔多少秒重新整理一次。

# SettingsPage_InactiveAccountUsageRefreshIntervalSettingsCard.Header
source: Refresh interval
ja_jp: 更新間隔
ko_kr: 새로고침 간격
zh_hans: 刷新间隔
zh_hant: 重新整理間隔

# SettingsPage_InactiveAccountUsageRefreshSettingsCard.Description
source: Refresh usage for inactive accounts at the selected second interval.
ja_jp: 選択した秒間隔で非アクティブアカウントの使用量を更新します。
ko_kr: 비활성 계정의 사용량을 지정한 초 단위 간격으로 새로고침합니다.
zh_hans: 按所选秒间隔刷新非活跃账号的用量。
zh_hant: 按所選秒間隔重新整理非使用中帳號的用量。

# SettingsPage_InactiveAccountUsageRefreshSettingsCard.Header
source: Inactive account automatic refresh
ja_jp: 非アクティブアカウントの自動更新
ko_kr: 비활성 계정 자동 새로고침
zh_hans: 非活跃账号自动刷新
zh_hant: 非使用中帳號自動重新整理

# SettingsPage_IntegratedLogExportSettingsCard.Description
source: Save the logs recorded during the current app session to a file. (Up to 1,000 entries)
ja_jp: アプリ実行中に記録したログをファイルに保存します。（最大 1,000 件）
ko_kr: 앱 실행 중 기록된 로그를 파일로 저장합니다. (최대 1,000건)
zh_hans: 将应用运行期间记录的日志保存到文件中。（最多 1,000 条）
zh_hant: 將應用程式執行期間記錄的日誌儲存為檔案。（最多 1,000 筆）

# SettingsPage_IntegratedLogExportSettingsCard.Header
source: Download integrated logs
ja_jp: 統合ログをダウンロード
ko_kr: 통합 로그 다운로드
zh_hans: 下载集成日志
zh_hant: 下載整合日誌

# SettingsPage_IntegratedLogFileTypeChoice
source: Text file
ja_jp: テキスト ファイル
ko_kr: 텍스트 파일
zh_hans: 文本文件
zh_hant: 文字檔

# SettingsPage_JapaneseLanguageComboBoxItem.Content
source: Japanese
ja_jp: 日本語
ko_kr: 일본어
zh_hans: 日语
zh_hant: 日文

# SettingsPage_KoreanLanguageComboBoxItem.Content
source: Korean
ja_jp: 韓国語
ko_kr: 한국어
zh_hans: 韩语
zh_hant: 韓文

# SettingsPage_LanguageRestartDialogMessage
source: The language setting has been saved. Restart the app to apply it reliably to every screen.
ja_jp: 言語設定を保存しました。すべての画面に確実に反映するには、アプリを再起動することをおすすめします。
ko_kr: 언어 설정이 저장되었습니다. 모든 화면에 안정적으로 반영하려면 앱을 재시작하는 것을 권장합니다.
zh_hans: 语言设置已保存。建议重启应用，以可靠应用到每个屏幕。
zh_hant: 語言設定已儲存。建議重新啟動應用程式，以可靠套用到所有畫面。

# SettingsPage_LanguageRestartDialogTitle
source: Restart recommended
ja_jp: 再起動をおすすめします
ko_kr: 재시작 권장
zh_hans: 建议重启
zh_hant: 建議重新啟動

# SettingsPage_LanguageSettingsCard.Description
source: Select the display language for the app. Restarting after a change is recommended.
ja_jp: アプリの表示言語を選択します。変更後は再起動をおすすめします。
ko_kr: 앱에서 사용할 표시 언어를 선택합니다. 변경 후 재시작을 권장합니다.
zh_hans: 选择应用显示语言。建议更改后重启。
zh_hant: 選擇應用程式顯示語言。建議變更後重新啟動。

# SettingsPage_LanguageSettingsCard.Header
source: Language
ja_jp: 言語
ko_kr: 언어
zh_hans: 语言
zh_hant: 語言

# SettingsPage_LightThemeComboBoxItem.Content
source: Light
ja_jp: ライト
ko_kr: 라이트
zh_hans: 浅色
zh_hant: 淺色

# SettingsPage_ManualSlotPrioritySettingsCard.Description
source: Set a value between 0 and 65535. When multiple widgets share the taskbar, a lower value places the widget farther from the taskbar buttons.
ja_jp: 0から65535までの値を入力してください。複数のウィジェットが同時に表示される場合、値が低いほどタスクバーボタンから遠くに配置されます。
ko_kr: 0에서 65535 사이의 값을 입력하세요. 여러 위젯이 함께 표시될 때 낮은 값일수록 작업 표시줄 버튼에서 멀리 배치됩니다.
zh_hans: 输入 0 到 65535 之间的值。当多个小组件同时显示在任务栏时，值越低则越远离任务栏按钮。
zh_hant: 輸入 0 到 65535 之間的值。當多個小元件同時顯示在工作列時，值越低則越遠離工作列按鈕。

# SettingsPage_ManualSlotPrioritySettingsCard.Header
source: Display priority
ja_jp: 表示優先順位
ko_kr: 표시 우선 순위
zh_hans: 显示优先级
zh_hant: 顯示優先順序

# SettingsPage_NextUsageRefreshFormat
source: Next refresh in {0}
ja_jp: 次回更新まで {0}
ko_kr: 다음 새로고침까지 {0}
zh_hans: 下次刷新还有 {0}
zh_hant: 下次重新整理还有 {0}

# SettingsPage_NoUpdateDialogMessage
source: The installed app is already up to date.
ja_jp: インストール済みのアプリはすでに最新です。
ko_kr: 현재 설치된 앱이 최신 상태입니다.
zh_hans: 已安装的应用已经是最新版本。
zh_hant: 已安裝的應用程式已經是最新版本。

# SettingsPage_NoUpdateDialogMessageFormat
source: {0} The installed app is already up to date.
ja_jp: {0} インストール済みのアプリはすでに最新です。
ko_kr: {0} 현재 설치된 앱이 최신 상태입니다.
zh_hans: {0} 已安装的应用已经是最新版本。
zh_hant: {0} 已安裝的應用程式已經是最新版本。

# SettingsPage_NoUpdateDialogTitle
source: You're up to date
ja_jp: 最新の状態です
ko_kr: 최신 버전
zh_hans: 已是最新
zh_hant: 已是最新

# SettingsPage_OpenStoreButtonText
source: Open Store
ja_jp: Store を開く
ko_kr: Store 열기
zh_hans: 打开 Store
zh_hant: 開啟 Store

# SettingsPage_PreferredMonitorRefreshButton.ToolTipService.ToolTip
source: Refresh monitor list
ja_jp: モニター一覧を更新
ko_kr: 모니터 목록 새로고침
zh_hans: 刷新显示器列表
zh_hant: 重新整理顯示器清單

# SettingsPage_PreferredMonitorSettingsCard.Description
source: Choose which monitor's taskbar to display the usage widget on.
ja_jp: タスクバーの使用量ウィジェットを表示するモニターを選択します。
ko_kr: 작업 표시줄 사용량 위젯을 표시할 모니터를 선택합니다.
zh_hans: 选择在哪个显示器的任务栏上显示使用量小组件。
zh_hant: 選擇在哪個顯示器的工作列上顯示使用量小工具。

# SettingsPage_PreferredMonitorSettingsCard.Header
source: Display monitor
ja_jp: 表示モニター
ko_kr: 표시할 모니터
zh_hans: 显示显示器
zh_hant: 顯示顯示器

# SettingsPage_PrimaryMonitorText
source: Primary monitor
ja_jp: プライマリモニター
ko_kr: 기본 모니터
zh_hans: 主显示器
zh_hant: 主顯示器

# SettingsPage_PrimaryUsageLowQuotaNotificationSettingsCard.Description
source: Save whether 5-hour low-quota notifications should be enabled.
ja_jp: 5時間の低クォータ通知を有効にするかどうかを保存します。
ko_kr: 5시간 저할당량 도달 알림 사용 여부를 저장합니다.
zh_hans: 保存是否启用 5 小时低配额通知。
zh_hant: 儲存是否啟用 5 小時低配額通知。

# SettingsPage_PrimaryUsageLowQuotaNotificationSettingsCard.Header
source: 5-hour low-quota notification
ja_jp: 5時間の低クォータ通知
ko_kr: 5시간 저할당량 알림
zh_hans: 5 小时低配额通知
zh_hant: 5 小時低配額通知

# SettingsPage_PrimaryUsageSurgeNotificationSettingsCard.Description
source: Show a notification when the 5-hour limit is being consumed rapidly.
ja_jp: 5 時間制限を急速に消費しているときに通知を表示します。
ko_kr: 5시간 한도를 급격히 소모할 때 알림을 표시합니다.
zh_hans: 当 5 小时限制被快速消耗时显示通知。
zh_hant: 當 5 小時限制被快速消耗時顯示通知。

# SettingsPage_PrimaryUsageSurgeNotificationSettingsCard.Header
source: 5-hour usage surge notification
ja_jp: 5 時間使用量急増通知
ko_kr: 5시간 사용량 급증 알림
zh_hans: 5 小时用量暴增通知
zh_hant: 5 小時用量暴增通知

# SettingsPage_PrimaryUsageSurgeNotificationThresholdSettingsCard.Description
source: Treat usage as surging when 5-hour usage increases by at least this percentage within the observation window.
ja_jp: 観察単位内で 5 時間使用量がこの割合以上増えた場合、急増として扱います。
ko_kr: 관찰 단위 동안 5시간 사용량이 이 비율 이상 늘어나면 급증으로 판단합니다.
zh_hans: 当 5 小时用量在观察单位内增加至少此百分比时，将其视为暴增。
zh_hant: 當 5 小時用量在觀察單位內增加至少此百分比時，將其視為暴增。

# SettingsPage_PrimaryUsageSurgeNotificationThresholdSettingsCard.Header
source: Surge threshold
ja_jp: 急増しきい値
ko_kr: 급증 기준
zh_hans: 暴增阈值
zh_hant: 暴增閾值
